# ML : Tutoriel sur MatplotLib

In [1]:
import pandas as pd

## Lecture des données

In [2]:
# Lecture d'un fichier CSV (où la première ligne représente les noms des colonnes)
# par défaut le séparateur est la virgule (,)

table1 = pd.read_csv('data/exp1.csv')

table1

   Note1  Note2  Note3
0     12     13      8
1     14     10      6
2     15     11      7

In [3]:
# Lorsqu'il y a des espacements entre les valeurs et le séparateur
# On doit les ignorer (pour ne pas avoir des valeurs avec espaces)

table2 = pd.read_csv('data/exp2.csv', skipinitialspace=True)

table2

   Note1  Note2  Note3
0     12     13      8
1     14     10      6
2     15     11      7

In [4]:
# Lorsque la première ligne est une ligne de données
# Donc, il n'y a pas une entête
# On doit l'indiquer afin de ne pas perdre l'échantillon

table3 = pd.read_csv('data/exp3.csv')

table3

   12  13  8
0  14  10  6
1  15  11  7

In [5]:
table3b = pd.read_csv('data/exp3.csv', header=None)

table3b

    0   1  2
0  12  13  8
1  14  10  6
2  15  11  7

In [6]:
# Pour ajouter des noms aux colonnes

table3c = pd.read_csv('data/exp3.csv', header=None, names=['Note_A', 'Note_B', 'Note_C'])

table3c

   Note_A  Note_B  Note_C
0      12      13       8
1      14      10       6
2      15      11       7

In [7]:
# Pour modifier le séparateur des colonnes 

table4 = pd.read_csv('data/exp3.csv', sep=';')

table4

   12,13,8
0  14,10,6
1  15,11,7